# GetServerId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalServer..::..GetServerId Method
IExternalServer Interface See Also
---
Implement this method to return the id of the server.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
Guid GetServerId()
```

Visual Basic
---
```text
Function GetServerId As Guid
```

Visual C++
---
```text
Guid GetServerId()
```

# ### Return Value
The id of the server.
# Remarks
The Id must uniquely identify the external server to the corresponding external service. It will be an error when two servers with identical Ids try to register for one external service.
# See Also
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace